//DEBUFF 列表
["中毒","暈眩","燒傷","凍傷","治癒"]
//中毒：3回合
//燒傷：2回合
//凍傷：2回合
//暈眩：1回合
//戰士村旁怪物
var monster_dict = {
map1_1:{  "史萊姆":{"hp":10,"exp":2,"money":2,"skill":{"撞擊":[2,20],"噴射":[3,20]}},
            "哥布林小鬼":{"hp":18,"exp":4,"money":3,"skill":{"砍擊":[3,15],"飛刀":[5,10]}},
            "火焰花":{"hp":15,"exp":8,"money":4,"skill":{"灼燒":[{"燒傷":5}, 5]}},
            "金屬史萊姆":{"hp":30,"exp":30,"money":5,"skill":{"撞擊":[2,100]}},
            "哥布林射手":{"hp":15,"exp":10,"money":3,"skill":{"射擊":[4,15],"續力一擊":[8,10]}},
            "野狗":{"hp":12,"exp":4,"money":2,"skill":{"咬":[3,20],"搖尾巴":[{"治癒":5},10]}}},

map1_1b:{"豬頭人士兵":{"hp":40,"exp":60,"money":10,"skill":{"鐵蹄踐踏":[6,10],"憤怒猛擊":[10,5],"野蠻怒吼":[{"暈眩":5},5]}}},

map1_2:{  "火焰史萊姆":{"hp":15,"exp":10,"money":3,"skill":{"撞擊":[4,20],"噴火":[6,10]}},
            "潮周土狗":{"hp":20,"exp":12,"money":4,"skill":{"咬咬":[4,20],"大咬一口":[8,10]}},
            "金屬史萊姆":{"hp":30,"exp":40,"money":5,"skill":{"撞擊":[3,100]}},
            "哥布林射手":{"hp":20,"exp":15,"money":4,"skill":{"射擊":[5,20],"續力一擊":[8,20]}},
            "哥布林投矛兵":{"hp":25,"exp":12,"money":23,"skill":{"突刺":[4,15],"丟矛":[8,5]}},
            "殺人豬":{"hp":25,"exp":20,"money":3,"skill":{"突進":[8,100]}},
            "迷幻菇":{"hp":18,"exp":14,"money":3,"skill":{"毒氣":{"中毒":8}}}},

map1_2b:{"豬頭人長老":{"hp":150,"exp":300,"money":15,"skill":{"颶風擺尾":[10,100],"閃電之擊":[15,100],"神聖烈焰":[{"燒傷":7},3]}}},


map1_3:{  "大史萊姆":{"hp":35,"exp":20,"money":4,"skill":{"鎮壓":[7,100],"大噴射":[12,100]}},
            "巨型野豬":{"hp":30,"exp":25,"money":5,"skill":{"衝撞":[10,100],"豬突猛進":[15,100]}},
            "新竹大塚馬":{"hp":30,"exp":30,"money":5,"skill":{"馬赫衝刺":[15,100],"施工":[20,100]}},
            "金屬史萊姆":{"hp":30,"exp":50,"money":5,"skill":{"撞擊":[10,100]}},
            "哥布林法師":{"hp":20,"exp":30,"money":4,"skill":{"魔力彈":[12,100],"魔力轟炸":[20,100]}},
            "哥布林投矛兵":{"hp":25,"exp":12,"money":3,"skill":{"突刺":[4,100],"丟矛":[8,100]}}},

map1_3b:{"暴食之王：究極豬頭人":{"hp":300,"exp":300,"money":20,"skill":{"豬頭狂轉":[15,100],"巨斧毀滅":[20,100],"肉蛋衝擊":[{"暈眩":10},100],"暴食奧義:吞食天地":[30,100]}}},

//盜賊地堡怪物
map2_1:{  "盜賊小兵":{"hp":10,"exp":2,"skill":{"撞擊":[],"噴射":[]}},
            "瘟疫蝙蝠":[],
            "盜賊衛兵":{},
            "尋血犬":{},
            "蜘蛛":{},
            "小豬撲滿":{}},
map2_2:{  "盜賊小兵":{"hp":10,"exp":2,"skill":{"撞擊":[],"噴射":[]}},
            "女妖":[],
            "盜賊守衛":{},
            "尋血犬":{},
            "小豬撲滿":{}},
map2_3:{  "盜賊守衛幹部":{"hp":10,"exp":2,"skill":{"撞擊":[],"噴射":[]}},
            "尋血犬王":[],
            "毒爆蝠":{},
            "女妖":{},
            "小豬撲滿":{},
            "暗影刺客":{}},
map2_4:{"貪婪之王：獨臂狗頭人":{"hp":100,"exp":200,"skill":{"獨臂斬":{},"賄絡戰士":{},"人肉盾牌":{},"貪婪奧義:王之寶庫":{}}}},

//死亡森林怪物
map3_1:{  "森林狼":{"hp":10,"exp":2,"skill":{"撞擊":[],"噴射":[]}},
            "樹妖":[],
            "變種哥布林":{},
            "食人花":{},
            "妖精":{},
            "血蟲":{}},
map3_2:{  "樹妖":{"hp":10,"exp":2,"skill":{"撞擊":[],"噴射":[]}},
            "巨型螳螂":[],
            "蜥蜴人":{},
            "血蟲":{},
            "妖精":{}},
map3_3:{  "森林狼王":{"hp":10,"exp":2,"skill":{"撞擊":[],"噴射":[]}},
            "亞歷哞哞":[],
            "狒狒王":{},
            "巨型螳螂":{},
            "死靈法師":{},
            "妖精":{}},
map3_4:{"色慾之王:金髮牛頭人":{"hp":100,"exp":200,"skill":{"槍出如龍":{},"臨陣磨槍":{},"捅昏":{},"色慾奧義:煉獄抽插":{}}}},

//大武鬥塔怪物
map4_1:{  "巨棍強森":{"hp":10,"exp":2,"skill":{"撞擊":[],"噴射":[]}},
            "石像鬼":[],
            "哥布林騎士長":{},
            "刀疤男":{},
            "寒冰射手":{},
            "狂暴賭徒":{}},
map4_2:{  "趙喜娜":{"hp":10,"exp":2,"skill":{"撞擊":[],"噴射":[]}},
            "鐵甲巨人":[],
            "盲眼武僧":{},
            "元素騎士":{},
            "狂暴賭徒":{}},
map4_3:{  "超合金黑鋼":{"hp":10,"exp":2,"skill":{"撞擊":[],"":[]}},
            "巫妖王":[],
            "黑衣劍士":{},
            "背心尊者":{},
            "禿頭披風俠":{},
            "狂暴賭徒":{}},
map4_4:{"憤怒之王:浴血虎頭人":{"hp":100,"exp":200,"skill":{"加爆神拳":{},"野蠻絞殺":{},"百獸轟拳":{},"憤怒奧義:心獸解放殺紅眼黑龍":{}}}},

//英靈神殿怪物
map5_1:{  "原人皮可":{"hp":10,"exp":2,"skill":{"撞擊":[],"噴射":[]}},
            "本部以藏":[],
            "范馬傑克":{},
            "當麻蹴速":{},
            "烈海王":{},
            "小丑":{}},
map5_2:{  "愚地克巳":{"hp":10,"exp":2,"skill":{"撞擊":[],"噴射":[]}},
            "烈海王":[],
            "奧利巴":{},
            "花山薰":{},
            "小丑":{}},
map5_3:{  "野見宿禰":{"hp":10,"exp":2,"skill":{"撞擊":[],"噴射":[]}},
            "愚地獨步":[],
            "郭海皇":{},
            "涉川剛氣":{},
            "宮本武藏":{},
            "小丑":{"hp":10,"exp":2,"skill":{"叭噗叭噗":[],"啾啾啾":[]}}},
map5_4:{"傲慢之王:無慈悲的蛙頭人":{"hp":100,"exp":200,"skill":{"":{},"":{},"舔昏":{},"傲慢奧義:":{}}}}

};